
                         MODELLER 10.6, 2024/10/17, r12888

     PROTEIN STRUCTURE MODELLING BY SATISFACTION OF SPATIAL RESTRAINTS


                     Copyright(c) 1989-2024 Andrej Sali
                            All Rights Reserved

                             Written by A. Sali
                               with help from
              B. Webb, M.S. Madhusudhan, M-Y. Shen, G.Q. Dong,
          M.A. Marti-Renom, N. Eswar, F. Alber, M. Topf, B. Oliva,
             A. Fiser, R. Sanchez, B. Yerkovich, A. Badretdinov,
                     F. Melo, J.P. Overington, E. Feyfant
                 University of California, San Francisco, USA
                    Rockefeller University, New York, USA
                      Harvard University, Cambridge, USA
                   Imperial Cancer Research Fund, London, UK
              Birkbeck College, University of London, London, UK


Kind, OS, HostName, Kernel, Processor: 4, Darwin Mauricios-MacBook-Air.local 24.4.0 arm64
Date and time of compilation         : 2024/10/17 13:37:50
MODELLER executable type             : mac12arm64-gnu
Job starting time (YY/MM/DD HH:MM:SS): 2025/05/17 12:59:22

environ____W> The class 'environ' is deprecated; use 'Environ' instead
openf___224_> Open           $(LIB)/restyp.lib
openf___224_> Open           ${MODINSTALL10v6}/modlib/resgrp.lib
rdresgr_266_> Number of residue groups:        2
openf___224_> Open           ${MODINSTALL10v6}/modlib/sstruc.lib

Dynamically allocated memory at   amaxlibraries [B,KiB,MiB]:       191566     187.076     0.183

Dynamically allocated memory at   amaxlibraries [B,KiB,MiB]:       192094     187.592     0.183
openf___224_> Open           ${MODINSTALL10v6}/modlib/resdih.lib

Dynamically allocated memory at   amaxlibraries [B,KiB,MiB]:       240694     235.053     0.230
rdrdih__263_> Number of dihedral angle types         :        9
              Maximal number of dihedral angle optima:        3
              Dihedral angle names                   :  Alph Phi Psi Omeg chi1 chi2 chi3 chi4 chi5
openf___224_> Open           ${MODINSTALL10v6}/modlib/radii.lib

Dynamically allocated memory at   amaxlibraries [B,KiB,MiB]:       253994     248.041     0.242
openf___224_> Open           ${MODINSTALL10v6}/modlib/af_mnchdef.lib
rdwilmo_274_> Mainchain residue conformation classes:  APBLE
openf___224_> Open           ${MODINSTALL10v6}/modlib/mnch.lib
rdclass_257_> Number of classes:        5
openf___224_> Open           ${MODINSTALL10v6}/modlib/mnch1.lib
openf___224_> Open           ${MODINSTALL10v6}/modlib/mnch2.lib
openf___224_> Open           ${MODINSTALL10v6}/modlib/mnch3.lib
openf___224_> Open           ${MODINSTALL10v6}/modlib/xs4.mat
rdrrwgh_268_> Number of residue types:       21
alignment__W> The class 'alignment' is deprecated; use 'Alignment' instead
model______W> The class 'model' is deprecated; use 'Model' instead
openf___224_> Open           2cr4.pdb

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       266204     259.965     0.254

Dynamically allocated memory at    amaxsequence [B,KiB,MiB]:       266280     260.039     0.254

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       266451     260.206     0.254

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       267301     261.036     0.255

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       268559     262.265     0.256

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       270463     264.124     0.258

Dynamically allocated memory at    amaxsequence [B,KiB,MiB]:       270503     264.163     0.258

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       270593     264.251     0.258

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       273449     267.040     0.261

Dynamically allocated memory at    amaxsequence [B,KiB,MiB]:       273509     267.099     0.261

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       273644     267.230     0.261

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       277928     271.414     0.265

Dynamically allocated memory at    amaxsequence [B,KiB,MiB]:       278016     271.500     0.265

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       278214     271.693     0.265

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       284640     277.969     0.271

Dynamically allocated memory at    amaxsequence [B,KiB,MiB]:       284772     278.098     0.272

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       285069     278.388     0.272

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       294691     287.784     0.281

Dynamically allocated memory at    amaxsequence [B,KiB,MiB]:       294891     287.979     0.281

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       295341     288.419     0.282

Dynamically allocated memory at amaxcoordinates [B,KiB,MiB]:       309791     302.530     0.295

Dynamically allocated memory at       amaxmodel [B,KiB,MiB]:       412783     403.108     0.394
read_mo_297_> Segments, residues, atoms:        1      126      989
read_mo_298_> Segment:        1  1:A  126:A      989

Dynamically allocated memory at   amaxalignment [B,KiB,MiB]:       416408     406.648     0.397

Dynamically allocated memory at   amaxstructure [B,KiB,MiB]:       489484     478.012     0.467
openf___224_> Open           CCND2.ali

Dynamically allocated memory at   amaxalignment [B,KiB,MiB]:       542246     529.537     0.517

Dynamically allocated memory at   amaxalignment [B,KiB,MiB]:       581054     567.436     0.554

Dynamically allocated memory at   amaxalignment [B,KiB,MiB]:       658670     643.232     0.628

Dynamically allocated memory at   amaxalignment [B,KiB,MiB]:       813902     794.826     0.776

Dynamically allocated memory at    amaxsequence [B,KiB,MiB]:       816142     797.014     0.778

Read the alignment from file       : CCND2.ali

Total number of alignment positions:   561

  #  Code        #_Res #_Segm PDB_code    Name
-------------------------------------------------------------------------------
  1       2cr4     126      1    2cr4.pdb MOL_ID  1; MOLECULE  SH3 DOMAIN-BINDING PROTEIN 2; CHAIN  A; FRAGMENT  SH2 DOMAI
  2      CCND2     561      1       CCND2
align2d_276_> 'align_block' changed to 1.
mkapsa__637W> No residue topology library is in memory.
              Better radii would be used if topology.read() is called first.
iup2crm_280W> No topology library in memory or assigning a BLK residue.
              Default CHARMM atom type assigned:  N -->  N
              This message is written only for the first such atom.
openf___224_> Open           $(LIB)/as1.sim.mat
rdrrwgh_268_> Number of residue types:       20

Pairwise dynamic programming alignment (ALIGN2D):
  Residue-residue metric   : $(LIB)/as1.sim.mat
  Diagonal                 :          100
  Overhang                 :            0
  Maximal gap length       :       999999
  Local alignment          :            F
  MATRIX_OFFSET (local aln):       0.0000
  FIX_OFFSETS              :      0.0    -1.0    -2.0    -3.0    -4.0
  N_SUBOPT                 :            0
  SUBOPT_OFFSET            :       0.0000
  Alignment block          :            1
  Gap introduction penalty :    -100.0000
  Gap extension penalty    :       0.0000
  Gap diagonal penalty     :       0.0000
  Structure gap penalties  :    3.500   3.500   3.500   0.200   4.000   6.500   2.000   0.000
  Break-break bonus        :   10000.0000
  Length of alignment      :          564
  Score                    :  101166.4453
openf___224_> Open           CCND2-2cr4.ali
openf___224_> Open           CCND2-2cr4.pap

Dynamically allocated memory at          finish [B,KiB,MiB]:       816142     797.014     0.778
Starting time                                            : 2025/05/17 12:59:22
Closing time                                             : 2025/05/17 12:59:24
Total CPU time [seconds]                                 :       1.33
